lahaus_api/app/controllers/application_controller.rb

  def logged_in?
    if token
      puts token
      user = User.find_by_id(token[0]['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def correct_user
    puts params
    render json: { message: 'Unauthorized' },
           status: :unauthorized unless (logged_in? == User.find(params[:user_id]) || logged_in?.isadmin)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]