lahaus_api/app/jobs/photo_quality_job.rb

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]
UPDATE "photos" SET "accepted_lum" = ?, "accepted_foc" = ?, "updated_at" = ? WHERE "photos"."id" = ?  [["accepted_lum", 1], ["accepted_foc", 1], ["updated_at", "2020-10-15 00:42:41.457844"], ["id", 6]]
---
  def perform(urls)
    print "XXXXXXXXXXXXXXXX"
    puts urls
=begin
    photos = Property.find(url).photos
    if photos.lenght > 0
      urls = ""
      for photo in photos
        urls += photo.url + " "
      end
      result = IO.popen("python3 IlluminationAnalyzer.py #{urls}")
      result = JSON.parse(result)
      if result.length > 0
        photos.each_with_index do |photo, i|
          photo.update_attributes(accepted: result[i])