lahaus_api/app/controllers/api/v1/photos_controller.rb

  def index
    begin
      property = Property.find(params[:property_id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    begin
      urls = params[:urls]
      user = User.find(params[:user_id])
      property = Property.find(params[:property_id])
      for url in urls
        photo = Photo.new(url: url, property_id: property.id)
        if !photo.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "photos" ("url", "property_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["url", "url1"], ["property_id", 1], ["created_at", "2020-10-13 21:03:10.698301"], ["updated_at", "2020-10-13 21:03:10.698301"]]