lahaus_api/app/controllers/api/v1/properties_controller.rb

  def create
    user_id = params[:user_id]
    property = Property.new(property_params)
    property.user_id = user_id
    if property.save
---
INSERT INTO "properties" ("built_type", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["built_type", "Casa"], ["city", "Medellin"], ["user_id", 38], ["created_at", "2020-09-29 14:21:01.532334"], ["updated_at", "2020-09-29 14:21:01.532334"]]