lahaus_api/app/controllers/api/v1/properties_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "properties".* FROM "properties"
---
  def index
    if params[:user_id]
      user = User.find(params[:user_id])
      properties = user.properties
    else
      properties = Property.all

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    begin
      property = Property.find(params[:property_id])

SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "properties" WHERE "properties"."id" = ?  [["id", 6]]
---
  def destroy
    begin
      property = Property.find(params[:property_id])
      if property.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "properties" ("built_type", "hood", "city", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["built_type", "Casa"], ["hood", "Poblado"], ["city", "Medellin"], ["user_id", 1], ["created_at", "2020-10-11 17:51:14.834087"], ["updated_at", "2020-10-11 17:51:14.834087"]]
---
  def create
    begin
      puts params
      user = User.find(params[:user_id])
      property = Property.new(property_params)
      if property.save