lahaus_api/app/controllers/api/v1/users_controller.rb

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "new_name"], ["updated_at", "2020-10-14 14:08:49.190834"], ["id", 1]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)