lahaus_api/app/controllers/api/v1/users_controller.rb

  def update
    begin
      user = User.find(params[:user_id])
      if user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "full_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["full_name", "newname"], ["updated_at", "2020-10-14 16:46:10.824819"], ["id", 1]]